<h1 align='center'><i> Hands On with Pandas </i></h1>

1. **Introduction**

2. **Creating and Viewing DataFrames and Series:**
   - `pd.DataFrame()`
   - `pd.Series()`
   - `df.head()`
   - `df.tail()`
   - `df.shape`
   - `df.dtypes`
   - `df.sample()`

3. **Data Aggregation and Statistics**
   - `df.sum()` 
   - `df.mean()`
   - `df.median()`
   - `df.max()`
   - `df.min()`
   - `df.count()`
   - `df.nunique()`
   - `df.info()`
   - `df.describe()`
   - `df.value_counts()`

3. **Indexing and Selection:**
   - `df['column_name']` 
   - `df.column_name` 
   - `df[['column_name']]`
   - `df.loc[row_label]`
   - `df.iloc[row_index]`
   - `df[df['column'] > value]`
   - `df[mask]`
   - `df.ix[]`
   - `df.where()`
   - `df.query()`
   - `df.isin()`

4. **Data Manipulation:**
   - `df.drop()`
   - `df.rename()`
   - `df.sort_values()`
   - `df.groupby()`
   - `df.get_group()`
   - `df['a'].astype('data_type')`
   - `df.set_index()`
   - `df.reset_index()`
   - `del df['col']`
   - `df.agg()`
   - `df.map()`
   - `df.rank()`

5. **Missing Data Handling:**
   - `df.isna()`
   - `df.dropna()`
   - `df.fillna()`
   - `df.isnull()`
   - `df.notnull()`

6. **Data Cleaning and Transformation:**
   - `df.apply()`
   - `df.replace()`
   - `df.duplicated()`
   - `df.drop_duplicates()`

8. **Merging and Joining DataFrames:**
   - `pd.concat()`
   - `pd.merge()`
   - `pd.join()`

9. **Working with Dates and Times:**
   - `pd.to_datetime()`
   - `df.resample()`

10. **Data Visualization:**
   - `df.plot()`
   - `df.hist()`, `df.boxplot()`

11. **IO Operations:**
   - `pd.read_csv()`, `pd.read_excel()`
   - `df.to_csv()`, `df.to_excel()`

## Introduction

Pandas is a popular open-source Python library widely used for data manipulation and analysis. It provides powerful data structures and functions that make working with structured data, such as CSV files, Excel sheets, SQL tables, and more, efficient and straightforward. The name *Pandas* is derived from "Panel Data," which is a term used in statistics and econometrics.

**DataFrame:** The core data structure in Pandas is the DataFrame, a two-dimensional labeled data structure with columns of potentially different data types. It resembles a spreadsheet or SQL table and allows data to be organized and analyzed effectively.

**Series:** Another essential data structure in Pandas is the Series, which is a one-dimensional labeled array. Series can hold data of any type and are used to represent a single column or row of data in a DataFrame.

### Installation

In [1]:
pip install pandas

Requirement already satisfied: pandas in /Users/ajitkumarsingh/opt/anaconda3/lib/python3.9/site-packages (1.4.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /Users/ajitkumarsingh/opt/anaconda3/lib/python3.9/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/ajitkumarsingh/opt/anaconda3/lib/python3.9/site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.18.5 in /Users/ajitkumarsingh/opt/anaconda3/lib/python3.9/site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in /Users/ajitkumarsingh/opt/anaconda3/lib/python3.9/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

## Creating and Viewing DataFrames and Series

### DataFrame

**From external file**

In [8]:
df_ext = pd.read_csv("data/nba.csv")

print(type(df_ext))

<class 'pandas.core.frame.DataFrame'>

**From python dictonary**

In [10]:
d = {"Name":["Ajit", "Sujit"], "Age":[23, 22]}

df_dict = pd.DataFrame(d)

df_dict.head(1)

   Name  Age
0  Ajit   23

In [13]:
df_ext.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [17]:
df_ext.shape

(458, 9)

In [18]:
df_ext.tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [24]:
df_ext.shape

(458, 9)

### Series

**From python list**

In [11]:
lst = [1, 2 , 3]

lst_series = pd.Series(lst)

type(lst_series)

pandas.core.series.Series

## Data Aggregation and Statistics

**EDA**

In [37]:
df_ext.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [38]:
df_ext.index

RangeIndex(start=0, stop=458, step=1)

In [30]:
df_ext.shape

(458, 9)

In [27]:
df_ext.count()

Name        457
Team        457
Number      457
Position    457
Age         457
Height      457
Weight      457
College     373
Salary      446
dtype: int64

In [29]:
df_ext.nunique()

Name        457
Team         30
Number       53
Position      5
Age          22
Height       18
Weight       87
College     118
Salary      309
dtype: int64

In [31]:
df_ext.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [32]:
df_ext.describe()

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

**Aggregation methods**

In [33]:
df_ext.sum()

/var/folders/xf/gcbfh98s6n53wh5f2hpb84nh0000gn/T/ipykernel_11849/2378096269.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df_ext.sum()

Number    8.079000e+03
Age       1.231100e+04
Weight    1.012360e+05
Salary    2.159837e+09
dtype: float64

In [36]:
df_ext.sum(axis = 0)

/var/folders/xf/gcbfh98s6n53wh5f2hpb84nh0000gn/T/ipykernel_11849/2263698965.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df_ext.sum(axis = 0)

Number    8.079000e+03
Age       1.231100e+04
Weight    1.012360e+05
Salary    2.159837e+09
dtype: float64

In [39]:
df_ext.min()

/var/folders/xf/gcbfh98s6n53wh5f2hpb84nh0000gn/T/ipykernel_11849/4103256542.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df_ext.min()

Number        0.0
Age          19.0
Weight      161.0
Salary    30888.0
dtype: float64

In [41]:
df_ext['Salary'].max()

25000000.0

In [42]:
df_ext.median()

/var/folders/xf/gcbfh98s6n53wh5f2hpb84nh0000gn/T/ipykernel_11849/2486152843.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df_ext.median()

Number         13.0
Age            26.0
Weight        220.0
Salary    2839073.0
dtype: float64

In [44]:
df_ext['Salary'].mean()

4842684.105381166

In [45]:
df_ext.value_counts()

Name                    Team                   Number  Position  Age   Height  Weight  College         Salary
Aaron Brooks            Chicago Bulls          0.0     PG        31.0  6-0     161.0   Oregon          2250000.0     1
Mike Muscala            Atlanta Hawks          31.0    PF        24.0  6-11    240.0   Bucknell        947276.0      1
Mike Dunleavy           Chicago Bulls          34.0    SG        35.0  6-9     230.0   Duke            4500000.0     1
Mike Conley             Memphis Grizzlies      11.0    PG        28.0  6-1     175.0   Ohio State      9588426.0     1
Michael Kidd-Gilchrist  Charlotte Hornets      14.0    SF        22.0  6-7     232.0   Kentucky        6331404.0     1
                                                                                                                    ..
Hassan Whiteside        Miami Heat             21.0    C         26.0  7-0     265.0   Marshall        981348.0      1
Harrison Barnes         Golden State Warriors  40.0    SF        24.0  6-8     225.0   North Carolina  3873398.0     1
Greivis Vasquez         Milwaukee Bucks        21.0    PG        29.0  6-6     217.0   Maryland        6600000.0     1
Greg Monroe             Milwaukee Bucks        15.0    C         26.0  6-11    265.0   Georgetown      16407500.0    1
Zach Randolph           Memphis Grizzlies      50.0    PF        34.0  6-9     260.0   Michigan State  9638555.0     1
Length: 364, dtype: int64

In [50]:
df_ext['Team'].value_counts()

New Orleans Pelicans      19
Memphis Grizzlies         18
New York Knicks           16
Milwaukee Bucks           16
Boston Celtics            15
Brooklyn Nets             15
Portland Trail Blazers    15
Oklahoma City Thunder     15
Denver Nuggets            15
Washington Wizards        15
Miami Heat                15
Charlotte Hornets         15
Atlanta Hawks             15
San Antonio Spurs         15
Houston Rockets           15
Dallas Mavericks          15
Indiana Pacers            15
Detroit Pistons           15
Cleveland Cavaliers       15
Chicago Bulls             15
Sacramento Kings          15
Phoenix Suns              15
Los Angeles Lakers        15
Los Angeles Clippers      15
Golden State Warriors     15
Toronto Raptors           15
Philadelphia 76ers        15
Utah Jazz                 15
Orlando Magic             14
Minnesota Timberwolves    14
Name: Team, dtype: int64

## Indexing and Selections

Indexing and selection in Pandas refer to the process of accessing specific rows, columns, or elements from a DataFrame or Series. Pandas provides various methods for indexing and selection, allowing you to extract the data you need for analysis and manipulation. Here are the main techniques for indexing and selection in Pandas:

**Indexing and Selection in DataFrame:**

1. **Bracket `[]` Operator:**
   - Selecting a Single Column: `df['column_name']` or `df.column_name`
   - Selecting Multiple Columns: `df[['col1', 'col2']]`

2. **`.loc[]` Operator:**
   - Selection by Label (Row and Column): `df.loc[row_label, column_label]`
   - Slicing Rows: `df.loc[start_row:end_row]`
   - Selecting Rows and Columns: `df.loc[row_labels, column_labels]`

3. **`.iloc[]` Operator:**
   - Selection by Integer Position (Row and Column): `df.iloc[row_index, col_index]`
   - Slicing Rows: `df.iloc[start_row:end_row]`
   - Selecting Rows and Columns: `df.iloc[row_indices, col_indices]`

4. **Boolean Indexing:**
   - Selecting Rows Based on Condition: `df[df['column'] > value]`
   - Combining Conditions: `df[(df['col1'] > value1) & (df['col2'] < value2)]`

5. **`.at[]` and `.iat[]`:**
   - Fast scalar value access by label or integer position: `df.at[row_label, column_label]` or `df.iat[row_index, col_index]`

**Indexing and Selection in Series:**

1. **Bracket `[]` Operator:**
   - Selecting by Label: `series[label]`
   - Selecting by Integer Position: `series[position]`
   - Selecting Multiple Elements: `series[start:end]`

2. **`.loc[]` Operator:**
   - Selection by Label: `series.loc[label]`
   - Slicing: `series.loc[start:end]`

3. **`.iloc[]` Operator:**
   - Selection by Integer Position: `series.iloc[position]`
   - Slicing: `series.iloc[start:end]`

4. **Boolean Indexing:**
   - Selecting Elements Based on Condition: `series[series > value]`

These indexing and selection methods allow you to retrieve specific data from a DataFrame or Series based on your needs. The selection techniques are flexible and powerful, making data extraction and analysis in Pandas efficient and intuitive. Remember that proper indexing and selection are essential for efficient data manipulation and analysis in Pandas.

### Data Frames

**Bracket `[]` Operator**

In [53]:
#single column
salary_series = df_ext['Salary']
salary_series

        Salary
0    7730337.0
1    6796117.0
2          NaN
3    1148640.0
4    5000000.0
..         ...
453  2433333.0
454   900000.0
455  2900000.0
456   947276.0
457        NaN

[458 rows x 1 columns]

In [55]:
#multiple columns
name_team_df = df_ext[["Name", "Salary"]]
name_team_df.head(3)

            Name     Salary
0  Avery Bradley  7730337.0
1    Jae Crowder  6796117.0
2   John Holland        NaN

**`.loc[]` operator**

In [59]:
#get salary for Name =  Avery Bradley
df_ext_name_salary = df_ext.loc[0, "Salary"]
df_ext_name_salary

7730337.0

In [60]:
df_ext.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [70]:
#get College and Salary for alternate Names upto index = 10
df_ext_name_salary = df_ext.loc[0:10:2, "College":"Salary"]
df_ext_name_salary

              College     Salary
0               Texas  7730337.0
2   Boston University        NaN
4                 NaN  5000000.0
6                 LSU  1170960.0
8          Louisville  1824360.0
10         Ohio State  2569260.0

**`.iloc[]` Operator**

In [71]:
df_ext.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [74]:
#get entry at 4th row and 5th column
result = df_ext.iloc[4, 5]
result

'6-10'

**Boolean Indexing**

In [76]:
#get all the players where age > 28
mask = df_ext["Age"] > 28
res_df = df_ext[mask]
res_df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
19,Jarrett Jack,Brooklyn Nets,2.0,PG,32.0,6-3,200.0,Georgia Tech,6300000.0
30,Arron Afflalo,New York Knicks,4.0,SG,30.0,6-5,210.0,UCLA,8000000.0
31,Lou Amundson,New York Knicks,17.0,PF,33.0,6-9,220.0,UNLV,1635476.0

In [80]:
df_ext.dropna(subset=["Name"], inplace=True)

In [99]:
#get all the players where Name starts with A and Salary is higher than the minimum
mask = df_ext["Name"].str.startswith("J") | df_ext["Salary"] > df_ext["Salary"].min()

res_df = df_ext[mask]
res_df.head()

Empty DataFrame
Columns: [Name, Team, Number, Position, Age, Height, Weight, College, Salary]
Index: []

In [98]:
df_ext["Name"].str.startswith("J"), df_ext["Salary"] > df_ext["Salary"].min()

(0      False
 1       True
 2       True
 3      False
 4       True
        ...
 452    False
 453    False
 454    False
 455    False
 456     True
 Name: Name, Length: 457, dtype: bool,
 0       True
 1       True
 2      False
 3       True
 4       True
        ...
 452     True
 453     True
 454     True
 455     True
 456     True
 Name: Salary, Length: 457, dtype: bool)

**`.at[]` and `.iat[]`**

In [102]:
df_ext.at[0,"Name"]

'Avery Bradley'

In [103]:
df_ext.iat[0, 0]

'Avery Bradley'

### Series

In [116]:
series = pd.Series(list(df_ext["Salary"]), index=df_ext["Name"])
series

Name
Avery Bradley    7730337.0
Jae Crowder      6796117.0
John Holland           NaN
R.J. Hunter      1148640.0
Jonas Jerebko    5000000.0
                   ...
Trey Lyles       2239800.0
Shelvin Mack     2433333.0
Raul Neto         900000.0
Tibor Pleiss     2900000.0
Jeff Withey       947276.0
Length: 457, dtype: float64

**Bracket `[]` Operator**

In [121]:
series["Avery Bradley"]

7730337.0

****

In [122]:
series[0]

7730337.0

**`loc[]` operator**

In [123]:
series.loc["Shelvin Mack":"Jeff Withey"]

Name
Shelvin Mack    2433333.0
Raul Neto        900000.0
Tibor Pleiss    2900000.0
Jeff Withey      947276.0
dtype: float64

**`iloc[]` operator**

In [124]:
series.iloc[0:2]

Name
Avery Bradley    7730337.0
Jae Crowder      6796117.0
dtype: float64

**Boolean Indexing**

In [127]:
#get all the records where salary is greater than 20000000
mask = series > 20000000

series[mask]

Name
Carmelo Anthony    22875000.0
Chris Paul         21468695.0
Kobe Bryant        25000000.0
Derrick Rose       20093064.0
LeBron James       22970500.0
Dwight Howard      22359364.0
Chris Bosh         22192730.0
Kevin Durant       20158622.0
dtype: float64

## Data Manipulation

1. **`df.drop()`:** Remove specified rows or columns from the DataFrame.

2. **`df.rename()`:** Rename columns or index labels.

3. **`df.sort_values()`:** Sort the DataFrame by specified columns.

4. **`df.groupby()`:** Group data based on one or more columns.

5. **`df.get_group()`:** Get a specific group from a grouped DataFrame using the group key.

6. **`df['a'].astype('data_type')`:** Convert the data type of a specific column 'a' to the specified data type.

7. **`df.set_index()`:** Set the DataFrame's index to a specific column.

8. **`df.reset_index()`:** Reset the DataFrame's index, optionally dropping the current index.

10. **`df.agg()`:** Perform aggregation operations on the DataFrame, like mean, sum, etc.

11. **`df.map()`:** Apply a function element-wise on a Series.

12. **`df.rank()`:** Compute numerical rank of elements in the DataFrame.

In [128]:
#import
import pandas as pd
import numpy as np

#read the data
df = pd.read_csv("data/nba.csv")

df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

**df.drop()**

In [129]:
#drop Heigh column

df_new = df.drop(columns=["Height"], axis=1)

In [130]:
df_new.head()

,Name,Team,Number,Position,Age,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,231.0,NaN,5000000.0

**df.rename()**

In [134]:
#rename College to University and Salary to Wages -> column renaming
df_renamed = df.rename(columns= {"College":"University", "Salary":"Wages"})

df_renamed.head(3)

,Name,Team,Number,Position,Age,Height,Weight,University,Wages
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [135]:
#index renaming -> 0 and 1 to x and y
df_renamed = df.rename(index= {0:"x", 1:"y"})

df_renamed.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
x,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
y,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [136]:
#index -> map all index to string
df_renamed = df.rename(index = str)

df_renamed.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

**`sort_values()`**

In [137]:
#sort the values in by salary in descending and by name ascending
df_sorted = df.sort_values(by=["Salary", "Name"], ascending=[False, True])

df_sorted.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
109,Kobe Bryant,Los Angeles Lakers,24.0,SF,37.0,6-6,212.0,NaN,25000000.0
169,LeBron James,Cleveland Cavaliers,23.0,SF,31.0,6-8,250.0,NaN,22970500.0
33,Carmelo Anthony,New York Knicks,7.0,SF,32.0,6-8,240.0,Syracuse,22875000.0

**`groupby()`**

In [150]:
#find mean of salary for each Team

df_grpd = df.groupby(by=["Team"], as_index=False)["Salary"].mean()

df_grpd.head(4)

                Team        Salary
0      Atlanta Hawks  4.860197e+06
1     Boston Celtics  4.181505e+06
2      Brooklyn Nets  3.501898e+06
3  Charlotte Hornets  5.222728e+06

In [156]:
#find avg, min, max and range of age of Age column for each team

df_grpd = df.groupby(by=["Team"], as_index=False).agg({"Age" : ["mean", "min", "max", lambda x : x.max()- x.min()]})

df_grpd.head()

                Team        Age
                           mean   min   max <lambda_0>
0      Atlanta Hawks  28.200000  22.0  35.0       13.0
1     Boston Celtics  24.733333  20.0  29.0        9.0
2      Brooklyn Nets  25.600000  21.0  32.0       11.0
3  Charlotte Hornets  26.133333  21.0  31.0       10.0
4      Chicago Bulls  27.400000  21.0  35.0       14.0

**`get_group`**

In [161]:
df_grpd = df.groupby("Team")

df_grpd.get_group("f").mean()

KeyError: 'f'

**`df['a'].astype('data_type')`**

In [163]:
#convert salary to nearest integer

df["Salary"] = df["Salary"].fillna(0).astype('int64')

df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000

**`df.set_index()`**

In [164]:
#set Team as index

df_index = df.set_index(keys=["Team"])

df_index.head(4)

,Name,Number,Position,Age,Height,Weight,College,Salary
Team,,,,,,,,
Boston Celtics,Avery Bradley,0.0,PG,25.0,6-2,180.0,Texas,7730337
Boston Celtics,Jae Crowder,99.0,SF,25.0,6-6,235.0,Marquette,6796117
Boston Celtics,John Holland,30.0,SG,27.0,6-5,205.0,Boston University,0
Boston Celtics,R.J. Hunter,28.0,SG,22.0,6-5,185.0,Georgia State,1148640

**`df.reset_index()`**

In [168]:
df_non_index = df_index.reset_index(level=None)
df_non_index.head(3)

,Team,Name,Number,Position,Age,Height,Weight,College,Salary
0,Boston Celtics,Avery Bradley,0.0,PG,25.0,6-2,180.0,Texas,7730337
1,Boston Celtics,Jae Crowder,99.0,SF,25.0,6-6,235.0,Marquette,6796117
2,Boston Celtics,John Holland,30.0,SG,27.0,6-5,205.0,Boston University,0

**`df.agg()`**

In [172]:
#find avg age of the players

df["mean_age"] = df["Age"].fillna(0).agg("mean")

df.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,mean_age
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337,26.879913
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117,26.879913
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0,26.879913

**`df.map()`**

In [175]:
#convert position to smaller case letters
df["Position"] = df["Position"].map({"PG":"pg"})

df.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,mean_age
0,Avery Bradley,Boston Celtics,0.0,NaN,25.0,6-2,180.0,Texas,7730337,26.879913
1,Jae Crowder,Boston Celtics,99.0,NaN,25.0,6-6,235.0,Marquette,6796117,26.879913
2,John Holland,Boston Celtics,30.0,NaN,27.0,6-5,205.0,Boston University,0,26.879913

**`df.rank()`**

In [181]:
#add rank column for each team wrt Salary

df["rank"] = df.groupby("Team")["Salary"].rank(ascending=False).astype('int')

df.head(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,mean_age,rank
0,Avery Bradley,Boston Celtics,0.0,NaN,25.0,6-2,180.0,Texas,7730337,26.879913,2
1,Jae Crowder,Boston Celtics,99.0,NaN,25.0,6-6,235.0,Marquette,6796117,26.879913,4
2,John Holland,Boston Celtics,30.0,NaN,27.0,6-5,205.0,Boston University,0,26.879913,15
3,R.J. Hunter,Boston Celtics,28.0,NaN,22.0,6-5,185.0,Georgia State,1148640,26.879913,14
4,Jonas Jerebko,Boston Celtics,8.0,NaN,29.0,6-10,231.0,NaN,5000000,26.879913,5

## Handling Missing Values

1. **`df.isna()`:**
   - Purpose: This method returns a DataFrame of the same shape as the original DataFrame `df`, where each element is a Boolean value indicating whether the corresponding value is NaN (Not a Number) or missing.
   - Usage: `df.isna()`

2. **`df.dropna()`:**
   - Purpose: This method is used to remove rows or columns containing any missing values (NaN) from the DataFrame `df`.
   - Usage:
     - Drop rows with missing values: `df.dropna()`
     - Drop columns with missing values: `df.dropna(axis=1)`

3. **`df.fillna()`:**
   - Purpose: This method is used to fill missing values in the DataFrame `df` with specified values.
   - Usage: `df.fillna(value)`, where `value` is the value you want to use to fill the missing values.

4. **`df.isnull()`:**
   - Purpose: This method is similar to `df.isna()` and returns a DataFrame of the same shape as `df` with Boolean values indicating whether the corresponding values are NaN (missing).
   - Usage: `df.isnull()`

5. **`df.notnull()`:**
   - Purpose: This method is the complement of `df.isnull()` and returns a DataFrame of the same shape as `df` with Boolean values indicating whether the corresponding values are not NaN (not missing).
   - Usage: `df.notnull()`

**`df.isna()`**

In [182]:
df_na = df.isna()

df_na.head(4)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,mean_age,rank
0,False,False,False,True,False,False,False,False,False,False,False
1,False,False,False,True,False,False,False,False,False,False,False
2,False,False,False,True,False,False,False,False,False,False,False
3,False,False,False,True,False,False,False,False,False,False,False

**`df.isnull()`**

In [183]:
df_null = df.isnull()

df_null.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,mean_age,rank
0,False,False,False,True,False,False,False,False,False,False,False
1,False,False,False,True,False,False,False,False,False,False,False
2,False,False,False,True,False,False,False,False,False,False,False
3,False,False,False,True,False,False,False,False,False,False,False
4,False,False,False,True,False,False,False,True,False,False,False

**`df.notnull`**

In [197]:
df_not_null = df.notnull()

df_not_null.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,mean_age,rank
0,True,True,True,False,True,True,True,True,True,True,True
1,True,True,True,False,True,True,True,True,True,True,True
2,True,True,True,False,True,True,True,True,True,True,True
3,True,True,True,False,True,True,True,True,True,True,True
4,True,True,True,False,True,True,True,False,True,True,True

**`df.dropna()`**

In [193]:
#drop column where a null value is there
df_col_drp = df.dropna(subset=["College"], axis=0, how="all", thresh=0.2)

df_col_drp.head(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,mean_age,rank
0,Avery Bradley,Boston Celtics,0.0,NaN,25.0,6-2,180.0,Texas,7730337,26.879913,2
1,Jae Crowder,Boston Celtics,99.0,NaN,25.0,6-6,235.0,Marquette,6796117,26.879913,4
2,John Holland,Boston Celtics,30.0,NaN,27.0,6-5,205.0,Boston University,0,26.879913,15
3,R.J. Hunter,Boston Celtics,28.0,NaN,22.0,6-5,185.0,Georgia State,1148640,26.879913,14
6,Jordan Mickey,Boston Celtics,55.0,NaN,21.0,6-8,235.0,LSU,1170960,26.879913,13

**`df.fillna()`**

In [196]:
#fill with null values
df["Number"] = df["Number"].fillna(df["Number"].mean(), axis=0)

df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,mean_age,rank
0,Avery Bradley,Boston Celtics,0.0,NaN,25.0,6-2,180.0,Texas,7730337,26.879913,2
1,Jae Crowder,Boston Celtics,99.0,NaN,25.0,6-6,235.0,Marquette,6796117,26.879913,4
2,John Holland,Boston Celtics,30.0,NaN,27.0,6-5,205.0,Boston University,0,26.879913,15
3,R.J. Hunter,Boston Celtics,28.0,NaN,22.0,6-5,185.0,Georgia State,1148640,26.879913,14
4,Jonas Jerebko,Boston Celtics,8.0,NaN,29.0,6-10,231.0,NaN,5000000,26.879913,5


**Data Cleaning and Transformation**

1. **`df.apply()`:**
   - Purpose: This method applies a function along either the rows or columns of the DataFrame.
   - Usage: `df.apply(func, axis=0, ...)` or `df.apply(func, axis=1, ...)`
   - Parameters:
     - `func`: The function to be applied to each row or column.
     - `axis`: Specifies the axis along which the function is applied. Use `axis=0` for column-wise and `axis=1` for row-wise application.

2. **`df.replace()`:**
   - Purpose: This method is used to replace specific values in the DataFrame with other values.
   - Usage: `df.replace(to_replace, value, inplace=False, ...)`
   - Parameters:
     - `to_replace`: The value or list of values to be replaced.
     - `value`: The value or list of values to replace `to_replace` with.
     - `inplace`: If True, the DataFrame is modified in place (i.e., no new DataFrame is created). If False (default), a new DataFrame with replaced values is returned.

3. **`df.duplicated()`:**
   - Purpose: This method identifies duplicate rows in the DataFrame and returns a boolean Series indicating whether each row is a duplicate.
   - Usage: `df.duplicated(subset=None, keep='first')`
   - Parameters:
     - `subset`: A list of column names to consider for identifying duplicates. If not provided, all columns are used.
     - `keep`: Determines which duplicates, if any, to mark as `True`. It can take the following values:
       - 'first' (default): Mark all duplicates as `True` except the first occurrence.
       - 'last': Mark all duplicates as `True` except the last occurrence.
       - False: Mark all duplicates as `True`.

4. **`df.drop_duplicates()`:**
   - Purpose: This method drops duplicate rows from the DataFrame and returns a new DataFrame with the duplicates removed.
   - Usage: `df.drop_duplicates(subset=None, keep='first', inplace=False)`
   - Parameters:
     - `subset`: A list of column names to consider for identifying duplicates. If not provided, all columns are used.
     - `keep`: Determines which duplicates, if any, to keep. It can take the same values as in `df.duplicated()`.
     - `inplace`: If True, the DataFrame is modified in place (i.e., no new DataFrame is created). If False (default), a new DataFrame with duplicates removed is returned.

**`df.apply`**

In [198]:
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,mean_age,rank
0,Avery Bradley,Boston Celtics,0.0,NaN,25.0,6-2,180.0,Texas,7730337,26.879913,2
1,Jae Crowder,Boston Celtics,99.0,NaN,25.0,6-6,235.0,Marquette,6796117,26.879913,4
2,John Holland,Boston Celtics,30.0,NaN,27.0,6-5,205.0,Boston University,0,26.879913,15
3,R.J. Hunter,Boston Celtics,28.0,NaN,22.0,6-5,185.0,Georgia State,1148640,26.879913,14
4,Jonas Jerebko,Boston Celtics,8.0,NaN,29.0,6-10,231.0,NaN,5000000,26.879913,5

In [205]:
def name_lower(names):
    return list(map(names, lambda x:x.lower()))

In [206]:
df.apply(lambda x : name_lower(x["Name"]), axis = 1)

TypeError: 'function' object is not iterable